# Число словами


def number_to_words(num: int) -> str | None:
    dig = ['', 'один', 'два', 'три', 'четыре', 'пять', 'шесть', 'семь', 'восемь', 'девять']
    dec = ['',  'десять', 'двадцать', 'тридцать', 'сорок', 'пятьдесят',
           'шестьдесят', 'семьдесят', 'восемьдесят', 'девяносто']
    teen = ['', 'одиннадцать', 'двенадцать', 'тринадцать', 'четырнадцать',
            'пятнадцать', 'шестнадцать', 'семнадцать', 'восемнадцать', 'девятнадцать']
    if 1 <= num <= 9:
        return dig[num]
    elif 10 <= num <= 19:
        if num == 10:
            return dec[1]
        else:
            return teen[num % 10]
    elif num in [10, 20, 30, 40, 50, 60, 70, 80, 90]:
        return dec[num // 10]
    elif 21 <= num <= 99:
        return dec[num // 10] + " " + dig[num % 10]
    return None


print(number_to_words(10))
print(number_to_words(23))